app/controllers/users_controller.rb

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "password_digest" = '$2a$10$H6ZbM9i/63wWzlChCHlHle7O8XgeP9o9IF9ovI5YoDyLfvNs17kjy', "remember_token" = 'h-LC8_SZCYUMZxSyb3V37A', "updated_at" = '2013-12-02 00:44:24.981924' WHERE "users"."id" = 1